Revit 2024 API
BuiltInFailures.LevelFailures.NoLevelsLeft Property
 There are no levels or plan views remaining in the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoLevelsLeft { get; }
Visual Basic
Public Shared ReadOnly Property NoLevelsLeft As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoLevelsLeft {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.LevelFailures Class
Autodesk.Revit.DB Namespace